configuration/src/InformationRegisters/СвязанныеОбъекты/СвязанныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеОбъекты</name>
  <resources>
    <name>РассчитыватьМетрикиСИсточником</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсточникСвязи</name>
    <type>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыСвязейОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриемникСвязи</name>
    <type>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/СвязанныеОбъекты/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет 2 записи в регистр СвязанныеОбъекты. С Источника на Приемник и наоборот 
//
// Параметры:
//  Источник - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку, СправочникСсылка.Проекты, СправочникСсылка.Филиалы - Источник связи
//  Приемник - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку, СправочникСсылка.Проекты, СправочникСсылка.Филиалы - Приемник связи
//  ВидСвязи - ПеречислениеСсылка.ВидыСвязейОбъектов - Вид связи
//  РассчитыватьМетрикиСИсточником - Булево - Ресурс
//
Процедура ДобавитьДвойнуюСвязь(Знач Источник, Знач Приемник, Знач ВидСвязи, Знач РассчитыватьМетрикиСИсточником) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсточникСвязи.Установить(Источник);
	НаборЗаписей.Отбор.ВидСвязи.Установить(ВидСвязи);
	НаборЗаписей.Отбор.ПриемникСвязи.Установить(Приемник);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ИсточникСвязи = Источник;
	НоваяЗапись.ПриемникСвязи = Приемник;
	НоваяЗапись.ВидСвязи = ВидСвязи;
	НоваяЗапись.РассчитыватьМетрикиСИсточником = РассчитыватьМетрикиСИсточником;
	
	НаборЗаписей.Записать();    
	
	НаборЗаписей = РегистрыСведений.СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсточникСвязи.Установить(Приемник);
	НаборЗаписей.Отбор.ВидСвязи.Установить(ВидСвязи);
	НаборЗаписей.Отбор.ПриемникСвязи.Установить(Источник);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ИсточникСвязи = Приемник;
	НоваяЗапись.ПриемникСвязи = Источник;
	НоваяЗапись.ВидСвязи = ВидСвязи;
	НоваяЗапись.РассчитыватьМетрикиСИсточником = РассчитыватьМетрикиСИсточником;
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры

// Удаляет 2 записи в регистре СвязанныеОбъекты. С Источника на Приемник и наоборот 
//
// Параметры:
//  Источник - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку, СправочникСсылка.Проекты, СправочникСсылка.Филиалы - Источник связи
//  Приемник - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку, СправочникСсылка.Проекты, СправочникСсылка.Филиалы - Приемник связи
//  ВидСвязи - ПеречислениеСсылка.ВидыСвязейОбъектов - Вид связи
//
Процедура УдалитьДвойнуюСвязь(Знач Источник, Знач Приемник, Знач ВидСвязи) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсточникСвязи.Установить(Источник);
	НаборЗаписей.Отбор.ВидСвязи.Установить(ВидСвязи);
	НаборЗаписей.Отбор.ПриемникСвязи.Установить(Приемник);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсточникСвязи.Установить(Приемник);
	НаборЗаписей.Отбор.ВидСвязи.Установить(ВидСвязи);
	НаборЗаписей.Отбор.ПриемникСвязи.Установить(Источник);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет запись из регистра СвязанныеОбъекты
//
// Параметры:
//  Источник - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку, СправочникСсылка.Проекты - Источник связи
//  Приемник - ДокументСсылка.Задача, ДокументСсылка.ЗаявкаНаРазработку, СправочникСсылка.Проекты - Приемник связи
//
Процедура УдалитьСвязь(Знач Источник, Знач Приемник) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИсточникСвязи.Установить(Источник);
	НаборЗаписей.Отбор.ПриемникСвязи.Установить(Приемник);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
